# SetClTextureR

## Description
Procedure SetClTextureR sets the right side wall texture of the specified class.

```pascal
PROCEDURE SetClTextureR(
				className  : STRING;
				textureRef : LONGINT);
```

```python

def vs.SetClTextureR(className, textureRef):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Class name.|
|textureRef|LONGINT|Texture reference index value.|

## Remarks
Sets the wall right texture of the class named className.

## Version
Availability: from VectorWorks8.0
## Category
* Textures